1kailian/GM_programmer/M480BSP-master/FTD_Writer/middleware/ftd_mw_display_manager.c
/****************************************************************************
@FILENAME:  ftd_mw_display_manager.c
@FUNCTION:
@AUTHOR:    yanxijiang
@DATE:      2025.10.24
@COPYRIGHT: FTD co.ltd
****************************************************************************/
#include "ftd_app_burn.h"
#include "ftd_mw_slave_manager.h"
#include "ftd_mw_display_manager.h"
#include "ftd_mw_sys_info_manager.h"
#include "ftd_mw_misc_manager.h"
#include "ftd_mw_log_manager.h"
#include "ftd_drv_panel_uart.h"
#include "ftd_drv_gpio.h"
#include "ftd_data_model.h"

#include "ftd_utils.h"

#include "NuMicro.h"
#include <stdio.h>
#include <stdbool.h>


#define PANNEL_CMD_LEN                      (0x12)  // fixed
static uint8_t pannel_tx_tail[3]            = { 0xff, 0xff, 0xff };
static uint8_t burn_status_ready[4]         = { 0xBE, 0xCD, 0xD0, 0xF7 };             // Jiu Xu
static uint8_t burn_status_connecting[6]    = { 0xC1, 0xAC, 0xBD, 0xD3, 0xD6, 0xD0 }; // LianJie Zhong
static uint8_t burn_status_burnning[6]      = { 0xC9, 0xD5, 0xC2, 0xBC, 0xD6, 0xD0 }; // ShaoLu Zhong
static uint8_t burn_status_verify[6]        = { 0xD0, 0xA3, 0xD1, 0xE9, 0xD6, 0xD0 }; // JiaoYan Zhong
static uint8_t burn_status_pass[4]          = { 0xB3, 0xC9, 0xB9, 0xA6 };             // Cheng Gong
static uint8_t burn_status_ng[4]            = { 0xCA, 0xA7, 0xB0, 0xDC };             // Shi Bai
static uint8_t start_burn[8]                = { 0xBF, 0xAA, 0xCA, 0xBC, 0xC9, 0xD5, 0xC2, 0xBC }; // KaiShi ShaoLu

static uint8_t pannel_tx_buffer[64];
static uint8_t pannel_rx_buffer[PANNEL_CMD_LEN]; // !!!The total data length sent from the panel to the MCU is fixed at 14 bytes.
SYS_INFO g_sys_info;
static DISPLAY_INFO st_display_info;

/**
 * Display manager event callback function pointer
 */
static void (*g_fp_display_event_callback)(PANEL_TO_MCU_CMD event, uint8_t param) = NULL;



/**
 * Build UART packet according to TJC-UART-HMI protocol,No ACK mechanism in panel communication
 *
 * UART-HMI Command Frame Structure:
 * page n \xFF \xFF \xFF
 * p[n].tn.txt="dispaly content"\xFF \xFF \xFF
 * 'n' is page id or txt id
 *
 * @param cmd Command type to be sent
 * @param sub_cmd Sub Command type to be sent
 * @param p_buff_in Pointer to parameter data
 * @param buff_len Length of parameter data in bytes, p_buff[0] is sub cmd id when buff_len is 0
 * @return Total length of the packet including header, command, length field, parameters and checksum
 */
static uint16_t ftd_mw_display_manager_build_cmd_packet(MCU_TO_PANEL_CMD cmd, uint16_t sub_cmd, uint8_t* p_buff_in, uint16_t buff_len);

/**
 * Build UART packet according to TJC-UART-HMI protocol,No ACK mechanism in panel communication
 *
 * UART-HMI Command Frame Structure:
 * page n \xFF \xFF \xFF
 * p[n].tn.txt="dispaly content"\xFF \xFF \xFF
 * 'n' is page id or txt id
 *
 * @param cmd Command type to be sent
 * @param p_buff Pointer to parameter data
 * @param buff_len Length of parameter data in bytes
 * @return Total length of the packet including header, command, length field, parameters and checksum
 */
static uint16_t ftd_mw_display_manager_build_packet(MCU_TO_PANEL_CMD cmd, uint8_t* p_buff, uint16_t buff_len);

static uint16_t ftd_mw_display_manager_msg_parse(void)
{
    uint16_t cmd_type = 0;
    cmd_type = ftd_uart_protocol_decode(pannel_rx_buffer, sizeof(pannel_rx_buffer), 0x08); // 0x08 min length of cmd
    return cmd_type;
}


void ftd_mw_display_manager_sync_channel_burn_status(CHANNEL_BURN_STATUS* p_st_channel_burn_status)
{
    uint16_t packet_len = 0;
    uint16_t wait_time = 1000;

    JYMC_LOG_TRACE("sync channel burn status start");
    // temporary solution , do not check rx complete and fifo empty
    //while ((false == ftd_drv_panel_uart_is_rx_complete()) && (false == ftd_drv_panel_uart_is_rx_fifo_empty()));
    JYMC_LOG_TRACE("sync channel burn status wait 1 end");

    //pkt_len = ftd_mw_display_manager_build_packet(MCU_TO_PANEL_CMD_CHANNEL_STATUS, (uint8_t*)p_st_channel_burn_status, sizeof(CHANNEL_BURN_STATUS));
    //ftd_drv_panel_uart_tx_start(pannel_tx_buffer, pkt_len);

    for (uint8_t i = BURN_PROCESS_BAR; i < (BURN_REMAIN_CNT + 1); i++)
    {
        packet_len = ftd_mw_display_manager_build_cmd_packet(MCU_TO_PANEL_CMD_CHANNEL_STATUS, i, (uint8_t*)p_st_channel_burn_status, sizeof(CHANNEL_BURN_STATUS));

        if (packet_len > 0)
        {
            //if (BURN_BUTTON_STATUS == j)
                //FTD_LOG_TRACE_BUFF(pannel_tx_buffer, sizeof(pannel_tx_buffer), packet_len);
            ftd_drv_panel_uart_tx_start(pannel_tx_buffer, packet_len);
            while (!ftd_drv_panel_uart_is_tx_complete());
            FTD_LOG_DEBUG_BUFF(pannel_tx_buffer, sizeof(pannel_tx_buffer), packet_len);
        }
    }

    JYMC_LOG_TRACE("sync channel burn status wait 2 in");
    //while (!ftd_drv_panel_uart_is_tx_complete());
    JYMC_LOG_TRACE("sync channel burn status wait 2 end");
    ftd_drv_panel_uart_rx_start(pannel_rx_buffer, sizeof(pannel_rx_buffer)); // because closed rx's pdma int in tx send
}

void ftd_mw_display_manager_set_button_state(BRUN_STATUS_E state)
{
    CHANNEL_BURN_STATUS st_channel_burn_status;

    st_channel_burn_status.cur_burnning_status = state;

    uint16_t packet_len = ftd_mw_display_manager_build_cmd_packet(MCU_TO_PANEL_CMD_CHANNEL_STATUS, BURN_BUTTON_STATUS,
        (uint8_t*)&st_channel_burn_status, sizeof(CHANNEL_BURN_STATUS));

    if (packet_len > 0)
    {
        ftd_drv_panel_uart_tx_start(pannel_tx_buffer, packet_len);
        //FTD_LOG_DEBUG("SEND:%d, len: 0x%x", i, packet_len);
        while (!ftd_drv_panel_uart_is_tx_complete());
        FTD_LOG_DEBUG_BUFF(pannel_tx_buffer, sizeof(pannel_tx_buffer), packet_len);

        ftd_drv_panel_uart_rx_start(pannel_rx_buffer, PANNEL_CMD_LEN);
    }
}

void ftd_mw_display_manager_key_press(void)
{
    if (HMI_FW_BURN_STATUS == st_display_info.curr_page_id)
    {
        uint8_t  app_mode;
        uint16_t wait_time = 1000;

        ftd_mw_misc_manager_buzzer_open(10);

        pannel_tx_buffer[0] = 5;
        uint16_t pkt_len = ftd_mw_display_manager_build_packet(MCU_TO_PANEL_CMD_PAGE_CHANGE, pannel_tx_buffer, 0);
        ftd_drv_panel_uart_tx_start(pannel_tx_buffer, pkt_len);
        while (!ftd_drv_panel_uart_is_tx_complete() && wait_time-- > 0);
        FTD_LOG_DEBUG_BUFF(pannel_tx_buffer, sizeof(pannel_tx_buffer), pkt_len);

        if (BURN_STOP == ftd_app_burn_get_general_burn_state() || APP_BURN_ENGINE != app_ftd_state_machine_get_current_state())
        {
            ftd_mw_display_manager_set_button_state(BURN_RUNNING);
            app_mode = APP_BURN_ENGINE;
            g_fp_display_event_callback(PANEL_TO_MCU_CMD_APP_MODE, app_mode);
        }

