1kailian/GM_programmer/M480BSP-master/FTD_Writer/middleware/ftd_mw_display_manager.c
        ftd_drv_panel_uart_rx_start(pannel_rx_buffer, PANNEL_CMD_LEN);
    }
}


void ftd_mw_display_manager_init(SYS_INFO* p_st_sys_info)
{
    uint16_t packet_len = 0;

    memcpy(&g_sys_info, p_st_sys_info, sizeof(SYS_INFO));
    
    JYMC_LOG_INFO("mw_display init");
    ftd_drv_panel_uart_rx_start(pannel_rx_buffer, PANNEL_CMD_LEN);

    // reset display info
    memset(&st_display_info, 0x00, sizeof(DISPLAY_INFO));

    // send all data to panel
    packet_len = ftd_mw_display_manager_build_cmd_packet(MCU_TO_PANEL_CMD_PAGE_CHANGE, HMI_HOME, NULL, 0);
    if (packet_len > 0)
    {
        ftd_drv_panel_uart_tx_start(pannel_tx_buffer, packet_len);
        while (!ftd_drv_panel_uart_is_tx_complete());
        FTD_LOG_TRACE_BUFF(pannel_tx_buffer, sizeof(pannel_tx_buffer), packet_len);
    }
}

/**
 * Set the event callback function for display manager
 *
 * @param fp_callback Pointer to the callback function
 *
 * @note The callback function will be called when display events occur
 * @note Callback function signature: void callback_func(PANEL_TO_MCU_CMD event, uint8_t param)
 */
void ftd_mw_display_manager_set_event_call_back(void (*fp_callback)(PANEL_TO_MCU_CMD event, uint8_t param))
{
    g_fp_display_event_callback = fp_callback;
}


void ftd_mw_display_manager_rx_process(void)
{
    static bool rx_start = false;
    uint16_t wait_time = 1000;

    if (!rx_start)
    {
        rx_start = true;
        JYMC_LOG_INFO("ftd_drv_panel_uart_rx_start");
        ftd_drv_panel_uart_rx_start(pannel_rx_buffer, PANNEL_CMD_LEN);
    }

    if (ftd_drv_panel_uart_is_rx_complete())
    {
        #if (LOG_TYPE >= LOG_LEVEL_DEBUG)
        FTD_LOG_DEBUG("panel_rx_buffer_len:%d", sizeof(pannel_rx_buffer));
        FTD_LOG_DEBUG_BUFF(pannel_rx_buffer, sizeof(pannel_rx_buffer), sizeof(pannel_rx_buffer));
        #endif
        // 1.check and parse rx data valid,and callback
        uint16_t pannel_cmd = ftd_mw_display_manager_msg_parse();
        FTD_LOG_INFO("RECV PANEL_CMD_ID: %d", pannel_cmd);

        ftd_mw_sys_info_manager_get(&g_sys_info);

        switch (pannel_cmd)
        {
            // panel get sys info
            case PNL2WTR_OP_GET_INFO:
            {
                uint16_t packet_len = 0;

                // reset display info
                memset(&st_display_info, 0x00, sizeof(DISPLAY_INFO));

                FTD_LOG_DEBUG("RECV PANNEL GET SYS_INFO");
                for (uint8_t i = 0; i < SYS_INFO_MAX; i++)
                {
                    pannel_tx_buffer[0] = i;
                    packet_len = ftd_mw_display_manager_build_packet(MCU_TO_PANEL_CMD_SYS_INFO, pannel_tx_buffer, 0);
                    if (packet_len > 0)
                    {
                        ftd_drv_panel_uart_tx_start(pannel_tx_buffer, packet_len);
                        //FTD_LOG_DEBUG("SEND:%d, len: 0x%x", i, packet_len);
                        while (!ftd_drv_panel_uart_is_tx_complete());
                        FTD_LOG_DEBUG_BUFF(pannel_tx_buffer, sizeof(pannel_tx_buffer), packet_len);
                    }
                }

                FTD_LOG_DEBUG("SEND BURN STATUS INFO");

                for (uint8_t i = 0; i < BURN_CHANNEL; i++)
                {
                    CHANNEL_BURN_STATUS st_channel_burn_status;

                    st_channel_burn_status.channel_num          = i;
                    st_channel_burn_status.cur_burnning_status  = BURN_STOP;
                    st_channel_burn_status.burn_error_code      = SLAVE_CMD_NONE;
                    st_channel_burn_status.burn_process_rate    = 0x00;

                    for (uint8_t j = BURN_PROCESS_BAR; j < BURN_STATUS_MAX; j++)
                    {
                        packet_len = ftd_mw_display_manager_build_cmd_packet(MCU_TO_PANEL_CMD_CHANNEL_STATUS, j, (uint8_t*)&st_channel_burn_status, sizeof(CHANNEL_BURN_STATUS));

                        if (packet_len > 0)
                        {
                            //if (BURN_BUTTON_STATUS == j)
                                //FTD_LOG_TRACE_BUFF(pannel_tx_buffer, sizeof(pannel_tx_buffer), packet_len);
                            ftd_drv_panel_uart_tx_start(pannel_tx_buffer, packet_len);
                            while (!ftd_drv_panel_uart_is_tx_complete());
                            FTD_LOG_DEBUG_BUFF(pannel_tx_buffer, sizeof(pannel_tx_buffer), packet_len);
                        }
                    }
                }

                break;
            }
            // panel select fw id
            case PNL2WTR_OP_BURN_FW1:
            case PNL2WTR_OP_BURN_FW2:
            case PNL2WTR_OP_BURN_FW3:
            {
                uint8_t  fw_id;
                FTD_LOG_DEBUG("RECV PANNEL FW SELECT %d ", (pannel_cmd - PNL2WTR_OP_BURN_FW1));

                // update display info
                st_display_info.select_fw_id = (pannel_cmd - PNL2WTR_OP_BURN_FW1);
                st_display_info.last_page_id = (pannel_cmd - PNL2WTR_OP_BURN_FW1) + HMI_FW_SELECT_1;
                st_display_info.curr_page_id = HMI_BURN_MODE_SELECT;

                // change to page 7, mode select page
                pannel_tx_buffer[0] = HMI_BURN_MODE_SELECT;
                uint16_t pkt_len = ftd_mw_display_manager_build_packet(MCU_TO_PANEL_CMD_PAGE_CHANGE, pannel_tx_buffer, 0);
                ftd_drv_panel_uart_tx_start(pannel_tx_buffer, pkt_len);
                while (!ftd_drv_panel_uart_is_tx_complete() && wait_time-- > 0);
                FTD_LOG_DEBUG_BUFF(pannel_tx_buffer, sizeof(pannel_tx_buffer), pkt_len);

                fw_id = (pannel_cmd - PNL2WTR_OP_BURN_FW1); // 0:fw1, 1:fw2, 2:fw3
                g_fp_display_event_callback(PANEL_TO_MCU_CMD_BURNNING_FW_SELECT, fw_id);

                break;
            }
            case PNL2WTR_OP_BURN_STOP:
            {
                //uint8_t  app_mode;
                FTD_LOG_DEBUG("RECV PANNEL BURN STOP %d ", pannel_cmd);

                //app_mode = APP_PROGRAMMING;
                //g_fp_display_event_callback(PANEL_TO_MCU_CMD_APP_MODE, app_mode);

