1kailian/GM_programmer/M480BSP-master/FTD_Writer/middleware/ftd_mw_display_manager.c
                ftd_app_burn_set_wind_up(0x01);
                break;
            }
            // panel set burn mode
            case PNL2WTR_OP_BURN_MODE_MANUAL:
            case PNL2WTR_OP_BURN_MODE_AUTO:
            {
                uint8_t  burn_type;
                FTD_LOG_DEBUG("RECV PANNEL BURN MODE %d ", (pannel_cmd - PNL2WTR_OP_BURN_MODE_MANUAL));

                // update display info
                st_display_info.last_page_id = st_display_info.curr_page_id;
                st_display_info.curr_page_id = HMI_FW_BURN_STATUS;

                // change to page 5, burn state page
                pannel_tx_buffer[0] = HMI_FW_BURN_STATUS;
                uint16_t pkt_len = ftd_mw_display_manager_build_packet(MCU_TO_PANEL_CMD_PAGE_CHANGE, pannel_tx_buffer, 0);
                ftd_drv_panel_uart_tx_start(pannel_tx_buffer, pkt_len);
                while (!ftd_drv_panel_uart_is_tx_complete() && wait_time-- > 0);
                FTD_LOG_DEBUG_BUFF(pannel_tx_buffer, sizeof(pannel_tx_buffer), pkt_len);

                burn_type = pannel_cmd - PNL2WTR_OP_BURN_MODE_MANUAL; // 0:manual, 1:auto
                g_fp_display_event_callback(PANEL_TO_MCU_CMD_BURNNING_MODE, burn_type);
                break;
            }
            // panel trigger burn start
            case PNL2WTR_OP_BURN_START:
            {
                uint8_t  app_mode;
                FTD_LOG_DEBUG("RECV PANNEL BURN START %d ", pannel_cmd);

                if (BURN_STOP == ftd_app_burn_get_general_burn_state() || APP_BURN_ENGINE != app_ftd_state_machine_get_current_state())
                {
                    ftd_mw_display_manager_set_button_state(BURN_RUNNING);
                    app_mode = APP_BURN_ENGINE;
                    g_fp_display_event_callback(PANEL_TO_MCU_CMD_APP_MODE, app_mode);
                }

                break;
            }
            // back to last page
            case PNL2WTR_OP_PAGE_5_BURN:
            case PNL2WTR_OP_PAGE_7_MODE:
            {
                uint16_t packet_len = 0;
                uint16_t page_id = HMI_HOME;

                if (HMI_FW_BURN_STATUS == st_display_info.curr_page_id || PNL2WTR_OP_PAGE_5_BURN == pannel_cmd)
                {
                    page_id = HMI_BURN_MODE_SELECT;
                }
                else if (HMI_BURN_MODE_SELECT == st_display_info.curr_page_id || PNL2WTR_OP_PAGE_7_MODE == pannel_cmd)
                {
                    page_id = st_display_info.select_fw_id + HMI_FW_SELECT_1;
                }

                FTD_LOG_TRACE("lst %d cur %d fw_id %d", st_display_info.last_page_id, st_display_info.curr_page_id, st_display_info.select_fw_id);

                st_display_info.last_page_id = st_display_info.curr_page_id;
                st_display_info.curr_page_id = page_id;

                packet_len = ftd_mw_display_manager_build_cmd_packet(MCU_TO_PANEL_CMD_PAGE_CHANGE, page_id, NULL, 0);

                if (packet_len > 0)
                {
                    ftd_drv_panel_uart_tx_start(pannel_tx_buffer, packet_len);
                    while (!ftd_drv_panel_uart_is_tx_complete());
                    FTD_LOG_TRACE_BUFF(pannel_tx_buffer, sizeof(pannel_tx_buffer), packet_len);
                }

                break;
            }
            case PNL2WTR_OP_SCREEN_VER:
            {
                uint8_t screen_ver = pannel_rx_buffer[FRAME_HEADER_SIZE + CMD_SIZE + PARAM_LEN_SIZE + 4];
                uint8_t curr_ver = (g_sys_info.st_writer_info.writer_sw_ver[12] - 0x30) << 4 | (g_sys_info.st_writer_info.writer_sw_ver[11] - 0x30);

                FTD_LOG_DEBUG("RECV PANNEL SW VER %x, curr ver %x", screen_ver, curr_ver);

                if (screen_ver != curr_ver)
                {
                    g_sys_info.st_writer_info.writer_sw_ver[12] = (screen_ver & 0xf0) >> 4;
                    g_sys_info.st_writer_info.writer_sw_ver[11] =  screen_ver & 0x0f;
                    g_sys_info.st_writer_info.writer_sw_ver[12] += 0x30;
                    g_sys_info.st_writer_info.writer_sw_ver[11] += 0x30;

                    ftd_mw_sys_info_manager_set(&g_sys_info);
                    ftd_mw_sys_info_manager_save_nv();
                    //ftd_mw_sys_info_manager_writer_info_dump(&g_sys_info.st_writer_info);
                }
            }

            default:
                break;
        }

        //2.set rx buffer to zero
        memset(pannel_rx_buffer, 0x00, sizeof(pannel_rx_buffer));

        //3.start rx
        ftd_drv_panel_uart_rx_start(pannel_rx_buffer, PANNEL_CMD_LEN);
    }
}


/**
 * Build UART packet according to TJC-UART-HMI protocol,No ACK mechanism in panel communication
 *
 * UART-HMI Command Frame Structure:
 * page n \xFF \xFF \xFF
 * p[n].tn.txt="dispaly content"\xFF \xFF \xFF
 * 'n' is page id or txt id
 *
 * @param cmd Command type to be sent
 * @param sub_cmd Sub Command type to be sent
 * @param p_buff_in Pointer to parameter data
 * @param buff_len Length of parameter data in bytes
 * @return Total length of the packet including header, command, length field, parameters and checksum
 */
static uint16_t ftd_mw_display_manager_build_cmd_packet(MCU_TO_PANEL_CMD cmd, uint16_t sub_cmd, uint8_t* p_buff_in, uint16_t buff_len)
{
    uint16_t pkt_len = 0;

    if (NULL == p_buff_in && 0 < buff_len)
        return 0;

    // 1. check cmd type and copy p_buff_in
    switch (cmd)
    {
        case MCU_TO_PANEL_CMD_CHANNEL_STATUS:
        {
            CHANNEL_BURN_STATUS* p_st_channel_burn_status;

            if (sizeof(CHANNEL_BURN_STATUS) == buff_len)
                p_st_channel_burn_status = (CHANNEL_BURN_STATUS*)p_buff_in;
            else
                return 0;

            switch (sub_cmd)
            {
                case BURN_PROCESS_BAR:
                {
                    char pannel_tx_info[] = "p[5].j0.val=";

                    pannel_tx_info[6] = p_st_channel_burn_status->channel_num + 0x30; // add 0x30, convert to ASCII

                    memcpy(&pannel_tx_buffer[pkt_len], (uint8_t*)pannel_tx_info, sizeof(pannel_tx_info) - 1); // do not copy the last char
                    pkt_len += sizeof(pannel_tx_info) - 1;

