1kailian/GM_programmer/M480BSP-master/FTD_Writer/middleware/ftd_mw_display_manager.c
                    sprintf((char*)&pannel_tx_buffer[pkt_len], "%03d", p_st_channel_burn_status->burn_process_rate);
                    pkt_len += 0x03;

                    break;
                }
                case BURN_PROCESS_STATUS:
                {
                    char pannel_tx_info[] = "p[5].t0.txt=\"";

                    pannel_tx_info[6] = p_st_channel_burn_status->channel_num + 0x30; // add 0x30, convert to ASCII

                    memcpy(&pannel_tx_buffer[pkt_len], (uint8_t*)pannel_tx_info, sizeof(pannel_tx_info) - 1);
                    pkt_len += sizeof(pannel_tx_info) - 1;

                    if (BURN_STOP == p_st_channel_burn_status->cur_burnning_status)
                    {
                        memcpy(&pannel_tx_buffer[pkt_len], (uint8_t*)burn_status_ready, sizeof(burn_status_ready));
                        pkt_len += sizeof(burn_status_ready);
                    }
                    else if (BURN_RUNNING == p_st_channel_burn_status->cur_burnning_status)
                    {
                        if (SLAVE_CMD_NONE == p_st_channel_burn_status->burn_error_code)
                        {
                            if (SLAVE_CMD_ENTER_BOOT_LOADER == p_st_channel_burn_status->burn_process_state)
                            {
                                memcpy(&pannel_tx_buffer[pkt_len], (uint8_t*)burn_status_connecting, sizeof(burn_status_connecting));
                                pkt_len += sizeof(burn_status_connecting);
                            }
                            else if (SLAVE_CMD_READ_CODE_CRC == p_st_channel_burn_status->burn_process_state || 
                                SLAVE_CMD_READ_CODE_CRC_PARM == p_st_channel_burn_status->burn_process_state)
                            {
                                memcpy(&pannel_tx_buffer[pkt_len], (uint8_t*)burn_status_verify, sizeof(burn_status_verify));
                                pkt_len += sizeof(burn_status_verify);
                            }
                            else if (SLAVE_CMD_STATE_SORT == p_st_channel_burn_status->burn_process_state)
                            {
                                memcpy(&pannel_tx_buffer[pkt_len], (uint8_t*)burn_status_pass, sizeof(burn_status_pass));
                                pkt_len += sizeof(burn_status_pass);
                            }
                            else
                            {
                                memcpy(&pannel_tx_buffer[pkt_len], (uint8_t*)burn_status_burnning, sizeof(burn_status_burnning));
                                pkt_len += sizeof(burn_status_burnning);
                            }
                        }
                        else
                        {
                            memcpy(&pannel_tx_buffer[pkt_len], (uint8_t*)burn_status_ng, sizeof(burn_status_ng));
                            pkt_len += sizeof(burn_status_ng);
                        }
                    }
                    else if (BURN_DONE == p_st_channel_burn_status->cur_burnning_status)
                    {
                        if (SLAVE_CMD_NONE == p_st_channel_burn_status->burn_error_code)
                        {
                            memcpy(&pannel_tx_buffer[pkt_len], (uint8_t*)burn_status_pass, sizeof(burn_status_pass));
                            pkt_len += sizeof(burn_status_pass);
                        }
                        else
                        {
                            memcpy(&pannel_tx_buffer[pkt_len], (uint8_t*)burn_status_ng, sizeof(burn_status_ng));
                            pkt_len += sizeof(burn_status_ng);
                        }
                    }

                    pannel_tx_buffer[pkt_len++] = '"';

                    break;
                }
                case BURN_CNT:
                {
                    char pannel_tx_info[] = "p[5].t16.txt=\"";

                    pannel_tx_info[7] += p_st_channel_burn_status->channel_num;

                    memcpy(&pannel_tx_buffer[pkt_len], (uint8_t*)pannel_tx_info, sizeof(pannel_tx_info) - 1);
                    pkt_len += sizeof(pannel_tx_info) - 1;

                    sprintf((char*)&pannel_tx_buffer[pkt_len], "%05d", p_st_channel_burn_status->burn_success_count);
                    pkt_len += 5;

                    sprintf((char*)&pannel_tx_buffer[pkt_len], "/");
                    pkt_len += 1;

                    sprintf((char*)&pannel_tx_buffer[pkt_len], "%05d", p_st_channel_burn_status->burn_total_count);
                    pkt_len += 5;

                    pannel_tx_buffer[pkt_len++] = '"';

                    break;
                }
                case BURN_REMAIN_CNT:
                {
                    char pannel_tx_info[] = "p[5].t14.txt=\"";
                    memcpy(&pannel_tx_buffer[pkt_len], (uint8_t*)pannel_tx_info, sizeof(pannel_tx_info) - 1);
                    pkt_len += sizeof(pannel_tx_info) - 1;

                    sprintf((char*)&pannel_tx_buffer[pkt_len], "%d", g_sys_info.st_fw_info[p_st_channel_burn_status->fw_num].st_bin_info.remain_counts);
                    pkt_len += sizeof(g_sys_info.st_fw_info[p_st_channel_burn_status->fw_num].st_bin_info.remain_counts) * 2;
                    pannel_tx_buffer[pkt_len++] = '"';

                    break;
                }

                case BURN_BUTTON_STATUS:
                {
                    char pannel_tx_info[] = "p[5].t12.txt=\"";
                    memcpy(&pannel_tx_buffer[pkt_len], (uint8_t*)pannel_tx_info, sizeof(pannel_tx_info) - 1);
                    pkt_len += sizeof(pannel_tx_info) - 1;

                    /* burn engine is running */
                    if (BURN_RUNNING == p_st_channel_burn_status->cur_burnning_status || BURN_RUNNING == ftd_app_burn_get_general_burn_state())
                    {
                        memcpy(&pannel_tx_buffer[pkt_len], (uint8_t*)burn_status_burnning, sizeof(burn_status_burnning));
                        pkt_len += sizeof(burn_status_burnning);
                    }
                    /* burn engine is stop */
                    else if (BURN_STOP == ftd_app_burn_get_general_burn_state() || BURN_DONE == ftd_app_burn_get_general_burn_state())
                    {
                        memcpy(&pannel_tx_buffer[pkt_len], (uint8_t*)start_burn, sizeof(start_burn));
                        pkt_len += sizeof(start_burn);
                    }

                    pannel_tx_buffer[pkt_len++] = '"';

                    break;
                }

                case BURN_CHIP_TYPE:
                {
                    char pannel_tx_info[] = "p[5].t10.txt=\"";
                    memcpy(&pannel_tx_buffer[pkt_len], (uint8_t*)pannel_tx_info, sizeof(pannel_tx_info) - 1);
                    pkt_len += sizeof(pannel_tx_info) - 1;

