1kailian/GM_programmer/M480BSP-master/FTD_Writer/middleware/ftd_mw_display_manager.c
                    sprintf((char*)&pannel_tx_buffer[pkt_len], "%1d", g_sys_info.st_fw_info[p_st_channel_burn_status->fw_num].chip_id);

                    pkt_len += sizeof(g_sys_info.st_fw_info[p_st_channel_burn_status->fw_num].chip_id);
                    pannel_tx_buffer[pkt_len++] = '"';

                    break;
                }
                case BURN_FW_VER:
                {
                    char pannel_tx_info[] = "p[5].t13.txt=\"";
                    memcpy(&pannel_tx_buffer[pkt_len], (uint8_t*)pannel_tx_info, sizeof(pannel_tx_info) - 1);
                    pkt_len += sizeof(pannel_tx_info) - 1;

                    memcpy(&pannel_tx_buffer[pkt_len], (uint8_t*)g_sys_info.st_fw_info[p_st_channel_burn_status->fw_num].st_bin_info.ver, sizeof(g_sys_info.st_fw_info[p_st_channel_burn_status->fw_num].st_bin_info.ver));

                    //FTD_LOG_DEBUG_BUFF(g_sys_info.st_fw_info[p_st_channel_burn_status->fw_num].st_bin_info.ver, sizeof(g_sys_info.st_fw_info[p_st_channel_burn_status->fw_num].st_bin_info.ver), 
                    //    sizeof(g_sys_info.st_fw_info[p_st_channel_burn_status->fw_num].st_bin_info.ver));

                    pkt_len += sizeof(g_sys_info.st_fw_info[p_st_channel_burn_status->fw_num].st_bin_info.ver);
                    pannel_tx_buffer[pkt_len++] = '"';

                    break;
                }

                default:
                    break;
            }
            break;
        }
        case MCU_TO_PANEL_CMD_PAGE_CHANGE:
        {
            char pannel_tx_info[] = "page 0"; // actual size is 7

            pannel_tx_info[5] = sub_cmd & 0xFF;
            pannel_tx_info[5] += 0x30; // convert to ASCII

            memcpy(&pannel_tx_buffer[pkt_len], (uint8_t*)pannel_tx_info, sizeof(pannel_tx_info) - 1); // do not copy the last char
            pkt_len += sizeof(pannel_tx_info) - 1;

            break;
        }
        default:
        {
            break;
        }

    }

    // 2. add cmd tail
    if (0 != pkt_len)
    {
        memcpy(&pannel_tx_buffer[pkt_len], pannel_tx_tail, sizeof(pannel_tx_tail));
        pkt_len += sizeof(pannel_tx_tail);
    }

    return pkt_len;
}
/**
 * Build UART packet according to TJC-UART-HMI protocol,No ACK mechanism in panel communication
 *
 * UART-HMI Command Frame Structure:
 * page n \xFF \xFF \xFF
 * p[n].tn.txt="dispaly content"\xFF \xFF \xFF
 * 'n' is page id or txt id
 *
 * @param cmd Command type to be sent
 * @param p_buff Pointer to parameter data
 * @param buff_len Length of parameter data in bytes
 * @return Total length of the packet including header, command, length field, parameters and checksum
 */
static uint16_t ftd_mw_display_manager_build_packet(MCU_TO_PANEL_CMD cmd, uint8_t* p_buff, uint16_t buff_len)
{
    if (p_buff == NULL)
    {
        return 0;
    }

    // 1. check cmd type and copy p_param
    switch (cmd)
    {
        case MCU_TO_PANEL_CMD_PAGE_CHANGE:
        {
            p_buff[5] = p_buff[0] + 0x30;

            p_buff[0] = 'p';
            p_buff[1] = 'a';
            p_buff[2] = 'g';
            p_buff[3] = 'e';
            p_buff[4] = ' ';

            buff_len = 6;
            break;
        }
        case MCU_TO_PANEL_CMD_SYS_INFO:
        {
            SYS_INFO sys_info;
            ftd_mw_sys_info_manager_get(&sys_info);

            switch (p_buff[0])
            {
                case SYS_INFO_HW_VER:
                {
                    char pannel_tx_info[] = "p[0].t4.txt=\"";
                    endian_reverse_buff((uint8_t*)&sys_info.st_writer_info.writer_hw_ver, sizeof(sys_info.st_writer_info.writer_hw_ver));

                    memcpy(&p_buff[buff_len], (uint8_t*)pannel_tx_info, sizeof(pannel_tx_info) - 1);
                    buff_len += sizeof(pannel_tx_info) - 1;
                    memcpy(&p_buff[buff_len], (uint8_t*)&sys_info.st_writer_info.writer_hw_ver, 0x09);
                    buff_len += 0x09;
                    p_buff[buff_len++] = '"';

                    break;
                }
                case SYS_INFO_SW_VER:
                {
                    char pannel_tx_info[] = "p[0].t5.txt=\"";
                    endian_reverse_buff((uint8_t*)&sys_info.st_writer_info.writer_sw_ver, sizeof(sys_info.st_writer_info.writer_sw_ver));

                    memcpy(&p_buff[buff_len], (uint8_t*)pannel_tx_info, sizeof(pannel_tx_info) - 1);
                    buff_len += sizeof(pannel_tx_info) - 1;
                    memcpy(&p_buff[buff_len], (uint8_t*)&sys_info.st_writer_info.writer_sw_ver, 0x09);
                    buff_len += 0x09;
                    p_buff[buff_len++] = '"';
                    break;
                }
                case SYS_INFO_SN:
                {
                    char pannel_tx_info[] = "p[0].t6.txt=\"";
                    endian_reverse_buff((uint8_t*)&sys_info.st_writer_info.writer_sn, sizeof(sys_info.st_writer_info.writer_sn));

                    memcpy(&p_buff[buff_len], (uint8_t*)pannel_tx_info, sizeof(pannel_tx_info));
                    buff_len += sizeof(pannel_tx_info) - 1;
                    memcpy(&p_buff[buff_len], (uint8_t*)&sys_info.st_writer_info.writer_sn, 0x09);
                    buff_len += 0x09;
                    p_buff[buff_len++] = '"';

                    break;
                }
                case SYS_INFO_FW1_CHIP_ID:
                {
                    char pannel_tx_info[] = "p[2].t6.txt=\"";

                    memcpy(&p_buff[buff_len], (uint8_t*)pannel_tx_info, sizeof(pannel_tx_info) - 1);
                    buff_len += sizeof(pannel_tx_info) - 1;
                    sprintf((char*)&p_buff[buff_len], "%d", sys_info.st_fw_info[0].chip_id);
                    FTD_LOG_TRACE("p[2].t6.txt=%d", sys_info.st_fw_info[0].chip_id);
                    buff_len += sizeof(sys_info.st_fw_info[0].chip_id);
                    p_buff[buff_len++] = '"';
                    break;
                }
                case SYS_INFO_FW1_VER:
                {
                    char pannel_tx_info[] = "p[2].t7.txt=\"";
                    //endian_reverse_buff((uint8_t*)&sys_info.st_fw_info[0].st_bin_info.ver, sizeof(sys_info.st_fw_info[0].st_bin_info.ver));

                    memcpy(&p_buff[buff_len], (uint8_t*)pannel_tx_info, sizeof(pannel_tx_info) - 1);
                    buff_len += sizeof(pannel_tx_info) - 1;
                    memcpy(&p_buff[buff_len], (uint8_t*)&sys_info.st_fw_info[0].st_bin_info.ver, sizeof(sys_info.st_fw_info[0].st_bin_info.ver));
                    FTD_LOG_TRACE("p[2].t7.txt=%d", sys_info.st_fw_info[0].st_bin_info.ver);
                    buff_len += sizeof(sys_info.st_fw_info[0].st_bin_info.ver);
                    p_buff[buff_len++] = '"';
                    break;
                }
                case SYS_INFO_FW1_BURNED_CNT:
                {
                    char pannel_tx_info[] = "p[2].t8.txt=\"";

                    memcpy(&p_buff[buff_len], (uint8_t*)pannel_tx_info, sizeof(pannel_tx_info) - 1);
                    buff_len += sizeof(pannel_tx_info) - 1;
                    sprintf((char*)&p_buff[buff_len], "%d", sys_info.st_fw_info[0].st_bin_info.remain_counts);
                    FTD_LOG_TRACE("p[2].t8.txt=%d", sys_info.st_fw_info[0].st_bin_info.remain_counts);
                    buff_len += sizeof(sys_info.st_fw_info[0].st_bin_info.remain_counts);
                    p_buff[buff_len++] = '"';
                    break;
                }
                case SYS_INFO_FW1_TRIPLE_REMAIN_CNT:
                {
                    char pannel_tx_info[] = "p[2].t9.txt=\"";

                    memcpy(&p_buff[buff_len], (uint8_t*)pannel_tx_info, sizeof(pannel_tx_info) - 1);
                    buff_len += sizeof(pannel_tx_info) - 1;
                    sprintf((char*)&p_buff[buff_len], "%d", sys_info.st_fw_info[0].st_triple_info.remain_counts);
                    FTD_LOG_TRACE("p[2].t9.txt=%d", sys_info.st_fw_info[0].st_triple_info.remain_counts);
                    buff_len += sizeof(sys_info.st_fw_info[0].st_triple_info.remain_counts) * 2;
                    p_buff[buff_len++] = '"';
                    break;
                }
                case SYS_INFO_FW1_ROLLCODE_REMAIN_CNT:
                {
                    char pannel_tx_info[] = "p[2].t10.txt=\"";

