1kailian/GM_programmer/M480BSP-master/FTD_Writer/middleware/ftd_mw_display_manager.c
                    memcpy(&p_buff[buff_len], (uint8_t*)pannel_tx_info, 14);
                    buff_len += 14;
                    sprintf((char*)&p_buff[buff_len], "%d", sys_info.st_fw_info[0].st_roll_code_info.remain_counts);
                    FTD_LOG_TRACE("p[2].t10.txt=%d", sys_info.st_fw_info[0].st_roll_code_info.remain_counts);
                    buff_len += sizeof(sys_info.st_fw_info[0].st_roll_code_info.remain_counts);
                    p_buff[buff_len++] = '"';
                    break;
                }
                case SYS_INFO_FW2_CHIP_ID:
                {
                    char pannel_tx_info[] = "p[3].t6.txt=\"";

                    memcpy(&p_buff[buff_len], (uint8_t*)pannel_tx_info, sizeof(pannel_tx_info) - 1);
                    buff_len += sizeof(pannel_tx_info) - 1;
                    sprintf((char*)&p_buff[buff_len], "%d", sys_info.st_fw_info[1].chip_id);
                    buff_len += sizeof(sys_info.st_fw_info[1].chip_id);
                    p_buff[buff_len++] = '"';
                    break;
                }
                case SYS_INFO_FW2_VER:
                {
                    char pannel_tx_info[] = "p[3].t7.txt=\"";
                    //endian_reverse_buff((uint8_t*)&sys_info.st_fw_info[1].st_bin_info.ver, sizeof(sys_info.st_fw_info[1].st_bin_info.ver));

                    memcpy(&p_buff[buff_len], (uint8_t*)pannel_tx_info, sizeof(pannel_tx_info) - 1);
                    buff_len += sizeof(pannel_tx_info) - 1;
                    memcpy(&p_buff[buff_len], (uint8_t*)&sys_info.st_fw_info[1].st_bin_info.ver, sizeof(sys_info.st_fw_info[1].st_bin_info.ver));
                    buff_len += sizeof(sys_info.st_fw_info[1].st_bin_info.ver);
                    p_buff[buff_len++] = '"';
                    break;
                }
                case SYS_INFO_FW2_BURNED_CNT:
                {
                    char pannel_tx_info[] = "p[3].t8.txt=\"";

                    memcpy(&p_buff[buff_len], (uint8_t*)pannel_tx_info, sizeof(pannel_tx_info) - 1);
                    buff_len += sizeof(pannel_tx_info) - 1;
                    sprintf((char*)&p_buff[buff_len], "%d", sys_info.st_fw_info[1].st_bin_info.remain_counts);
                    buff_len += sizeof(sys_info.st_fw_info[1].st_bin_info.remain_counts);
                    p_buff[buff_len++] = '"';
                    break;
                }
                case SYS_INFO_FW2_TRIPLE_REMAIN_CNT:
                {
                    char pannel_tx_info[] = "p[3].t9.txt=\"";

                    memcpy(&p_buff[buff_len], (uint8_t*)pannel_tx_info, sizeof(pannel_tx_info) - 1);
                    buff_len += sizeof(pannel_tx_info) - 1;
                    sprintf((char*)&p_buff[buff_len], "%d", sys_info.st_fw_info[1].st_triple_info.remain_counts);
                    buff_len += sizeof(sys_info.st_fw_info[1].st_triple_info.remain_counts);
                    p_buff[buff_len++] = '"';
                    break;
                }
                case SYS_INFO_FW2_ROLLCODE_REMAIN_CNT:
                {
                    char pannel_tx_info[] = "p[3].t10.txt=\"";

                    memcpy(&p_buff[buff_len], (uint8_t*)pannel_tx_info, 14);
                    buff_len += 14;
                    sprintf((char*)&p_buff[buff_len], "%d", sys_info.st_fw_info[1].st_roll_code_info.remain_counts);
                    buff_len += sizeof(sys_info.st_fw_info[1].st_roll_code_info.remain_counts);
                    p_buff[buff_len++] = '"';
                    break;
                }
                case SYS_INFO_FW3_CHIP_ID:
                {
                    char pannel_tx_info[] = "p[3].t6.txt=\"";

                    memcpy(&p_buff[buff_len], (uint8_t*)pannel_tx_info, sizeof(pannel_tx_info) - 1);
                    buff_len += sizeof(pannel_tx_info) - 1;
                    sprintf((char*)&p_buff[buff_len], "%d", sys_info.st_fw_info[2].chip_id);
                    buff_len += sizeof(sys_info.st_fw_info[2].chip_id);
                    p_buff[buff_len++] = '"';
                    break;
                }
                case SYS_INFO_FW3_VER:
                {
                    char pannel_tx_info[] = "p[3].t7.txt=\"";
                    //endian_reverse_buff((uint8_t*)&sys_info.st_fw_info[2].st_bin_info.ver, sizeof(sys_info.st_fw_info[2].st_bin_info.ver));

                    memcpy(&p_buff[buff_len], (uint8_t*)pannel_tx_info, sizeof(pannel_tx_info) - 1);
                    buff_len += sizeof(pannel_tx_info) - 1;
                    memcpy(&p_buff[buff_len], (uint8_t*)&sys_info.st_fw_info[2].st_bin_info.ver, sizeof(sys_info.st_fw_info[2].st_bin_info.ver));
                    buff_len += sizeof(sys_info.st_fw_info[2].st_bin_info.ver);
                    p_buff[buff_len++] = '"';
                    break;
                }
                case SYS_INFO_FW3_BURNED_CNT:
                {
                    char pannel_tx_info[] = "p[3].t8.txt=\"";

                    memcpy(&p_buff[buff_len], (uint8_t*)pannel_tx_info, sizeof(pannel_tx_info) - 1);
                    buff_len += sizeof(pannel_tx_info) - 1;
                    sprintf((char*)&p_buff[buff_len], "%d", sys_info.st_fw_info[2].st_bin_info.remain_counts);
                    buff_len += sizeof(sys_info.st_fw_info[2].st_bin_info.remain_counts);
                    p_buff[buff_len++] = '"';
                    break;
                }
                case SYS_INFO_FW3_TRIPLE_REMAIN_CNT:
                {
                    char pannel_tx_info[] = "p[3].t9.txt=\"";

                    memcpy(&p_buff[buff_len], (uint8_t*)pannel_tx_info, sizeof(pannel_tx_info) - 1);
                    buff_len += sizeof(pannel_tx_info) - 1;
                    sprintf((char*)&p_buff[buff_len], "%d", sys_info.st_fw_info[2].st_triple_info.remain_counts);
                    buff_len += sizeof(sys_info.st_fw_info[2].st_triple_info.remain_counts);
                    p_buff[buff_len++] = '"';
                    break;
                }
                case SYS_INFO_FW3_ROLLCODE_REMAIN_CNT:
                {
                    char pannel_tx_info[] = "p[3].t10.txt=\"";

                    memcpy(&p_buff[buff_len], (uint8_t*)pannel_tx_info, sizeof(pannel_tx_info) - 1);
                    buff_len += sizeof(pannel_tx_info) - 1;
                    sprintf((char*)&p_buff[buff_len], "%d", sys_info.st_fw_info[2].st_roll_code_info.remain_counts);
                    buff_len += sizeof(sys_info.st_fw_info[2].st_roll_code_info.remain_counts);
                    p_buff[buff_len++] = '"';
                    break;
                }
                default:
                {
                    break;
                }

            }
            break;
        }
        default:
        {
            break;
        }
    }

    // 2. add cmd tail
    memcpy(&p_buff[buff_len], pannel_tx_tail, sizeof(pannel_tx_tail));
    buff_len += sizeof(pannel_tx_tail);

    return buff_len;
}
